//
//  ViewController.swift
//  Horoskop N15
//
//  Created by Zuka Papuashvili on 10.04.24.
//

import UIKit

protocol RecieveColorDelegate: AnyObject {
    func recieve(color: UIColor)
}

class ViewController: UIViewController, RecieveColorDelegate {
    
    let imageView = CustomImageView()
    let mainPageView = MainView()
    
    override func viewDidLoad() {
        super.viewDidLoad()
        addSubViews()
        configUI()
        addConstraints()
        mainPageView.button.addTarget(self, action: #selector(action), for: .touchUpInside)
    }
    
    override func viewWillAppear(_ animated: Bool) {
        super.viewWillAppear(animated)
        navigationController?.navigationBar.tintColor = UIColor.white
    }
    
    func addSubViews() {
        // Adding Subviews
        view.addSubview(imageView)
        view.addSubview(mainPageView)
        
        // Turn off auto resizing
        imageView.translatesAutoresizingMaskIntoConstraints = false
        mainPageView.translatesAutoresizingMaskIntoConstraints = false
    }
    
    func configUI() {
        view.backgroundColor = .backGroundColorBlack
        
    }
    
    func addConstraints() {
        NSLayoutConstraint.activate([
            // Image view constraints
            imageView.topAnchor.constraint(equalTo: view.topAnchor),
            imageView.leadingAnchor.constraint(equalTo: view.leadingAnchor),
            imageView.trailingAnchor.constraint(equalTo: view.trailingAnchor),
            imageView.bottomAnchor.constraint(equalTo: view.bottomAnchor),
            
            // Main view constraints
            mainPageView.topAnchor.constraint(equalTo: view.topAnchor),
            mainPageView.leadingAnchor.constraint(equalTo: view.leadingAnchor),
            mainPageView.trailingAnchor.constraint(equalTo: view.trailingAnchor),
            mainPageView.bottomAnchor.constraint(equalTo: view.bottomAnchor),
        ])
    }
    
    //MARK: Protocol Function
    
    func recieve(color: UIColor) {
        view.backgroundColor = color
    }
    
    //MARK: - Button Action:
    
    @objc func action() {
        guard let signName = self.mainPageView.textField.text, !signName.isEmpty,
              let zodiacSign = self.zodiacSign(forName: signName) else {
            let alertVC = UIAlertController(title: "Unknown Name ‼️", message: "გთხოვთ ჩაწეროთ ზოდიაქოები ქართულად, მაგალითად (ვერძი), (კურო) და ასე შემდეგ. მადლობა წინასწარ 😌", preferredStyle: .alert)
            let action = UIAlertAction(title: "Ok", style: .cancel)
            alertVC.addAction(action)
            present(alertVC, animated: true)
            print("No zodiac sign found for name: \(self.mainPageView.textField.text ?? "")")
            return
            
        }
        
        let descriptionVC = DescriptionVC()
        descriptionVC.zodiacSign = zodiacSign
        self.navigationController?.pushViewController(descriptionVC, animated: true)
        
        descriptionVC.delegate = self
    }
    
    //MARK: - ZodiacSign initializations.
    
    func zodiacSign(forName name: String) -> ZodiacSign? {
        switch name {
        case "ვერძი":
            return ZodiacSign(name: "ვერძი", imageName: "Icon-1", body: "ვერძების ენერგია და შეუპოვრობა ისეთივე ლეგენდარული გახდა, როგორც მათი სიჯიუტე, ასევე ხასიათის სრული მოუქნელობა. ვერძებს არ შეუძლიათ დათმობა ტაქტიკურ წარმოსახვაშიც კი, რითაც საკუთარ თავსაც არანაკლებ აზიანებენ, განსაკუთრებით ახალგაზრდობაში, როცა გამოცდილება არ აქვთ, რომელიც დაეხმარებათ დააცხროს ბუნებრივი სიფიცხე. თანდაყოლილი ოპტიმიზმი ვერძებს საშუალებას არ აძლევს ხელები ჩამოუშვან ყველაზე უსიამოვნო სიტუაციებშიც კი, მაგრამ კრიტიკას, განსაკუთრებით ახლობელი ადამიანებისგან, შეუძლია მათი წყობიდან გამოყვანა: მომავალში წარმატებულებს, ყოველთვის სჭირდებათ გამხნევება და მათი დამსახურების აღიარება.")
        case "კურო":
            return ZodiacSign(name: "კურო", imageName: "Icon-2", body: "კუროები ჩვეულებრივ კეთილები არიან, თუმცა სიკეთის გამოხატვაში მოხაერხებულობა აკლიათ, თან ძალიან ჯიუტები არიან. გარდა ამისა, ისინი ხშირად ჯიუტად ახვევენ თავს საკუთარ აზრს სხვებს, მოუწოდებენ მათ მიბაძონ და არც გავლენის სხვა მეთოდებზე ამბობენ უარს. ტყუილი მათ არ უყვართ, თუმცა ზოგჯერ იტყუებიან ისე, რომ მათი სიტყვები ნდობას იწვევენ. კუროები ისწრაფვიან დაიმსახურონ გარშემომყოფთა პატივისცემა და აღფრთოვანება, ამიტომ დიდ ყურადრებას აქცევენ როგორ აცვიათ, ცდილობენ წარმატებულები გამოჩნდნენ, თუმცა შეიძლება ასეთი საერთოდაც არ იყვნენ. საკუთარ მიზნებსა და დამოკიდებულებებში კუროები სტაბილურები არიან. მათ შეუძლიათ ჩანაფიქრი გადადონ, მაგრამ თავის გეგმებს არასოდეს არ ივიწყებენ.")
        case "ტყუპები":
            return ZodiacSign(name: "ტყუპები", imageName: "Icon-3", body: "ტყუპებს სხვა ნიშნებისგან გამოარჩევს განსაკუთრებული გაორება და არამდგრადობა ბევრ ქცევაში. მათ შეუძლიათ სიტუაცია ორმხრივად შეაფასონ ერთდროულად, ერთი და იგივე მომენტში განიცადონ სიყვარული და სიძულვილი, ზოგჯერ თავადაც არ ესმით საკუთარი ბუნების სირთულე. ტყუპები ცვალებადი ამინდივით არიან. ისინი აუტანლები იქნებოდნენ, რომ არ ჰქონდეთ მომხიბვლელობა. მათ უყვართ ურთიერთობა, მათთან საუბარი სასიამოვნოა, ამასთან საინტერესოც, რადგან მათ ბევრი თავგადასავლები აქვთ. გარდა ამისა, ტყუპები ადვილად ითვისებენ ცოდნას, რომელიც მათთვის პრაქტიკულად გამოუსადეგარია და ადვილად უზიარებენ სხვებს.")
        case "კირჩხიბი":
            return ZodiacSign(name: "კირჩხიბი", imageName: "Icon-4", body: "ამ ნიშნის ქვეშ დაბადებული ადამიანები გამოირჩევიან განსაკუთრებული მგრძნობელობით - ზერელედ ნასროლმა სიტყვამაც კი შეიძლება დეპრესიაში ჩააგდოს ისინი; ამასთან, კირჩხიბი ფლობს საკმაოდ ძლიერ შინაგან ენერგიას და მისი დათრგუნული შინაგანი მდგომარეობა მალევე გადაეცემა გარშემომყოფებს. თუმცა არ ღირს კირჩხიბის მუდმივ მელანქოლიკად წარმოდგენა, ყოველწუთს სამყაროს არასრულყოფილების გამო დატანჯულს, მასაც უყვარს სიცილი და დაჯილდოებულია კარგი იუმორის გრძნობით.")
        case "ლომი":
            return ZodiacSign(name: "ლომი", imageName: "Icon-5", body: "სხვებს ლომები ზემოდან უყურებენ, მაგრამ ნებისმიერ კრიტიკაზე მათი მისამართით მწვავედ და მტკივნეულად რეაგირებენ. საქმე იმაშია, რომ ამ ნიშნის ადამიანები მარტივად არ იყენებენ გვერდში ადამიანებს, რომლებსაც მათი ქცევის შეფასება შეეძლებათ. ლომებს ჩვეულებრივ ბევრი ნაცნობი ჰყავთ, მაგრამ ყველა მათგანის მიმართ თბილი დამოკიდებულება არ აქვთ. ისინი ხშირად გარშემო იკრებენ სასარგებლო ადამიანებს და აიგნორებენ მათ პირად ღირსებას. ზოგადად, საკუთარ შეცდომებზე სწავლა ლომებისთვის დამახასიათებელი არ არის. ყველა გამარჯვებას ისინი საკუთარი დამსახურებებით ხსნიან, ხოლო წარუმატებლობის მიზეზად ბედის სიმუხთლეს ასახელებენ.")
        case "ქალწული":
            return ZodiacSign(name: "ქალწული", imageName: "Icon-6", body: "ერთი შეხედვით ქალწულები ბევრს ეჩვენება პრობლემებში და საყოფაცხოვრებო წვრილმანებში ჩაფლულად, მაგრამ ეს წარმოდგენა მცდარია. ეს ადამიანები ძალიან ყურადღებიანი არიან და უშიშრად აღნიშნავენ ამ სამყაროს არასრულყოფილებას, განსაკუთრებით იმ სფეროებში, სადაც საქმის გამოსწორება შეუძლიათ. სწორედ ამიტომ საშუალოსტატისტიკური ქალწული პატარა პრინცივით ცდილობს მოაწესრიგოს თავისი პლანეტა და თუ ეს შეუძლებელია, მისი კუთვნილი კუთხის მოწყობას მაინც ახერხებს.")
        case "სასწორი":
            return ZodiacSign(name: "სასწორი", imageName: "Icon-7", body: "მომავლის წინასწარმეტყველება სასწორებს გამაოგნებლად ზუსტად შეუძლიათ, განსაკუთრებით ხასიათის მიხედვით. ისინი წარმატებულები და მხიარულები ჩანან, ყოველთვის გახსნილები ურთიერთობისთვის, თუმცა სასწორების ნატურა საწინააღმდეგოა და ცხოვრების ზოგიერთ პერიოდში ისინი ნამდვილ ურჩხულს ემსგავსებიან. სასწორების ბნელი მხარე იმდენად მიუღებელია, რამდენადაც მათი ნათელი მხარე. დროდადრო კაპრიზულობის, ნერვოზულობისა და სიავის გამო, ამ ნიშნის ადამიანები რისკავენ მეგობრების დაკარგვით, რომლებიც მიჩვეულნი არიან მათ სრულიად სხვაგვარ ქცევას. არასტაბილურები არიან სასწორები ცხოვრების წესშიც: აქტიურობა და დაუცხრომლობა პერიოდულად იცვლება სრული აპათიით, როცა არავის და არაფერს არ შეუძლია მათი ყურადღების მიქცევა. გამონაკლისს წარმოადგენენ წიგნები: სასწორებს კითხვა უყვართ ყოველთვის და კონცენტრირების კარგი უნარის წყალობით რთულ, უცნობ სფეროებზე არესებულ მასალასაც კარგად ითვისებენ და ამით დიდ სიამოვნებას იღებენ.")
        case "მორიელი":
            return ZodiacSign(name: "მორიელი", imageName: "Icon-8", body: "ზოგიერთი ასტროლოგი გამოყოფს მორიელის სამ ტიპს: შხამიანები (ავი, სამაგიეროს გადახდის სურვილის მქონე და დაუნდობლები, ასევე ისინი ხშირად საკუთარი აგრესიულობის მსხვერპლი ხდებიან) კეთილშობიელები (ასეთ ადამიანებს კიდევ არწივებს ეძახიან, ისინი სამართლიანი და ჯანსაღად მოაზროვნეები არიან, მორიელებს შორის ყველაზე ეგოისტურები და ჭკვიანები) და (ნაცრისფერი ხვლიკები). ეს უკანასკნელნი საშიშნი იქნებოდნენ, სუსტები რომ არ იყვნენ: მათ შეუძლიათ მხოლოდ ჩუმად ვერ იტანდნენ, მტკივნეულად გულჩათხრობილი არიან და შეიძლება უწყინარებიც კი ჩანდნენ, მაგრამ შესაძლებლობისთანავე მზად არიან მეგობარსაც კი უკბინონ.")
        case "მშვილდოსანი":
            return ZodiacSign(name: "მშვილდოსანი", imageName: "Icon-9", body: "მშვილდოსნების გულკეთილობა და გულახდილობა სამწუხაროდ გაწონასწორებულია იმპულსურობით, ზოგჯერ ზემდეტითაც კი. გარდა ამისა, ამ ნიშნის ადამიანები ადვილად ვარდებიან უკიდურესობაში, იძენენ მტრებს ხან ზედმეტი გულახდილობის და ხანაც სამართლიანობის გამო. საინტერესოა, რომ მშვილდოსნები ხშირად სხვის უფლებებს იცავენ, ვიდრე საკუთარს; ისინი მუდმივად გრძნობენ პასუხისმგებლობას სხვებზე, მაგრამ იშვიათად აბეზრებენ თავს მზრუნველობით.")
        case "თხის რქა":
            return ZodiacSign(name: "თხის რქა", imageName: "Icon-10", body: "თხის რქები იმ კატეგორიას განეკუთვნებიან, ვისაც შეუძლია ისწავლოს მთელი ცხოვრების მანძილზე. ამ ნიშნის ქვეშ დაბადებულ ადამიანებს გარესამყაროსთან ურთიერთობა არ უადვილდებათ: ისინი ამაყები არიან და დამოუკიდებლები ჩანან, მაგრამ ხშირად იტანჯებიან იმით, რომ გარშემომყოფთა სიმპათიას ვერ იმსახურებენ ან საკუთარი მოსაზრების დათმობა უწევთ. ერთი სიტყვით, თხის რქები კმაყოფილდებიან ვიწრო, მაგრამ თანამოაზრეებისგან შემდგარი წრით. გარდა ამისა, ისინი ვერ იტანენ სხვებზე დამოკიდებულებას, ამიტომ ხშირად ნაკლებად ცნობილი ადამიანების კამპანიას მარტოობას ამჯობინებენ. თხის რქები დიდწილად ეგოისტები არიან, თუმცა საკუთარ თავს სხვებზე უკეთესებად არ თვლიან; უფრო მეტიც, ბევრ თხის რქას მთელი ცხოვრება უწევს კომპლექსებთან ბრძლა და მთელ სამყაროზე განაწყენებულნი არიან, რომ სათანადოდ არ დააფასეს.")
        case "მერწყული":
            return ZodiacSign(name: "მერწყული", imageName: "Icon-11", body: "მერწყულებს გამოარჩევს განსაკუთრებული ცნობისმოყვარეობა და ცხოვრების ნებისმიერი ასპექტით დაინტერესება. ეს ხელს უშლით კონცენტრაცია მოახდინონ რაიმე კონკრეტულზე და ამის გამო ტოვებენ მატყუარა ადამიანის შთაბეჭდილებას, თუმცა ერთი დღით ადრე ასწრებენ ბევრი წვრილმანის შეცვლას. სიახლის შესწავლის შესაძლებლობა მერწყულების ერთ ნაწილს გენიოსებად აქცევს, მაგრამ დამღუპველად აისახება მეორე ნაწილის ფსიქიკაზე - მერწყულებს შორის სულიერად დაავადებულების რიცხვი ძალიან მაღალია.")
        case "თევზები":
            return ZodiacSign(name: "თევზები", imageName: "Icon-12", body: "თევზები სტაბილურობით არ გამოირჩევიან: მათ შეიძლება უარი თქვან საკუთარ დაპირებებზე ან სულაც დაივიწყონ, შეიცვალონ აზრი დღეში რამოდენიმეჯერ და მეგობრობის ზოგადად დაფასების მიუხედავად შეუძლიათ მსხვერპლად გაიღონ ზოგიერთი მათგანის ინტერესი. ზოგჯერ ამ ნიშნის ადამიანები იტყუებიან იმის გამო, რომ საკუთარი თავი ლამაზად წარმოაჩინონ სხვების თვალში, ზოგჯერ უმიზეზოდ აკეთებენ ამას. თევზები ბევრს სუსტებად ეჩვენებათ. გარდა ამისა, ამ ნიშნის ადამიანები ნაკლებად აფასებენ მატერიალურ კეთილდღეობას და დიდი მოთხოვნებით არ გამოირჩევიან, როცა საქმე ეხება მათი მუშაობის შედეგებს. როცა უჩნდებათ შანსი, რამე მიიღონ ზედმეტი ძალისხმევის გარეშე, ისინი ცდილობენ არ გაუშვან ეს შესაძლებლობა ხელიდან.")
        default:
            return nil
        }
    }
}
